In [1]:
import pandas as pd
import numpy as np
import random

In [2]:
rollno = list(range(1, 21))
rollno

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [5]:
sname = ('Alice', 'Tom', 'sophia', 'Ethian', 'Diana', 'Eric', 'Bob', 'Rihana', 'Bill', 'Katy',
'Max', 'Jennifer', 'Rosie', 'Alex', 'Ben', 'Emily', 'Sarah', 'Katrina', ' Quinn', 'kelly')
print(sname)

('Alice', 'Tom', 'sophia', 'Ethian', 'Diana', 'Eric', 'Bob', 'Rihana', 'Bill', 'Katy', 'Max', 'Jennifer', 'Rosie', 'Alex', 'Ben', 'Emily', 'Sarah', 'Katrina', ' Quinn', 'kelly')

In [7]:
genders_set = {"Male", "Female"}
gender= [random.choice(list(genders_set)) for _ in rollno]
print(list(gender))

['Female', 'Male', 'Female', 'Female', 'Male', 'Male', 'Female', 'Male', 'Female', 'Female', 'Male', 'Male', 'Male', 'Male', 'Male', 'Female', 'Female', 'Male', 'Female', 'Female']

In [7]:
gender.count('Male')

9

In [8]:
gender.count('Female')

11

In [9]:
print('Males-', gender.count('Male') , 'Female-', gender.count('Female'))

Males- 9 Female- 11

In [23]:
courses_dict = {1: "CS", 2: "IT", 3: "AI", 4: "DS"}

In [25]:
course = [courses_dict[random.randint(1, 4)] for _ in rollno]
print(list(course))

['DS', 'IT', 'CS', 'AI', 'IT', 'DS', 'DS', 'DS', 'CS', 'AI', 'IT', 'CS', 'DS', 'DS', 'IT', 'AI', 'CS', 'DS', 'AI', 'IT']

In [39]:
np.random.normal(70, 10, len(rollno))

array([74.11781071, 68.03390363, 55.20125929, 53.01952933, 56.86619434,
       69.48900793, 68.43045414, 78.83905465, 74.20815012, 62.22614975,
       75.6063006 , 79.32604297, 78.12330542, 66.09449224, 71.42946045,
       67.69764444, 72.07014055, 75.09428318, 88.82214276, 51.6167692 ])

In [32]:
a= np.arange(10)
print(a)
np.clip(a, 2, 6)

[0 1 2 3 4 5 6 7 8 9]

array([2, 2, 2, 3, 4, 5, 6, 6, 6, 6])

In [35]:
age= np.random.randint(18, 25, size=len(rollno))
print(age)

[24 19 18 22 24 24 22 18 23 19 21 22 20 20 22 22 22 22 20 21]

In [38]:
print(rollno, '\n', sname, '\n', gender, '\n', course, '\n', age)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
 ('Alice', 'Tom', 'sophia', 'Ethian', 'Diana', 'Eric', 'Bob', 'Rihana', 'Bill', 'Katy', 'Max', 'Jennifer', 'Rosie', 'Alex', 'Ben', 'Emily', 'Sarah', 'Katrina', ' Quinn', 'kelly')
 ['Female', 'Female', 'Female', 'Female', 'Male', 'Female', 'Male', 'Female', 'Female', 'Female', 'Female', 'Male', 'Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Male', 'Male']
 ['DS', 'IT', 'CS', 'AI', 'IT', 'DS', 'DS', 'DS', 'CS', 'AI', 'IT', 'CS', 'DS', 'DS', 'IT', 'AI', 'CS', 'DS', 'AI', 'IT']
 [24 19 18 22 24 24 22 18 23 19 21 22 20 20 22 22 22 22 20 21]

In [45]:
df= pd.DataFrame({"rollno": rollno, "sname": sname, "gender":gender, "course": course, "age": age})
print(df)

    rollno     sname  gender course  age
0        1     Alice  Female     DS   24
1        2       Tom  Female     IT   19
2        3    sophia  Female     CS   18
3        4    Ethian  Female     AI   22
4        5     Diana    Male     IT   24
5        6      Eric  Female     DS   24
6        7       Bob    Male     DS   22
7        8    Rihana  Female     DS   18
8        9      Bill  Female     CS   23
9       10      Katy  Female     AI   19
10      11       Max  Female     IT   21
11      12  Jennifer    Male     CS   22
12      13     Rosie  Female     DS   20
13      14      Alex    Male     DS   20
14      15       Ben    Male     IT   22
15      16     Emily    Male     AI   22
16      17     Sarah  Female     CS   22
17      18   Katrina    Male     DS   22
18      19     Quinn    Male     AI   20
19      20     kelly    Male     IT   21

In [42]:
df.head()

   rollno   sname  gender course  age
0       1   Alice  Female     DS   24
1       2     Tom  Female     IT   19
2       3  sophia  Female     CS   18
3       4  Ethian  Female     AI   22
4       5   Diana    Male     IT   24

In [46]:
df.tail()

    rollno    sname  gender course  age
15      16    Emily    Male     AI   22
16      17    Sarah  Female     CS   22
17      18  Katrina    Male     DS   22
18      19    Quinn    Male     AI   20
19      20    kelly    Male     IT   21

In [50]:
df.shape

(20, 5)